Revit 2026 API

# WorksharingDisplayMode Enumeration

---

Indicates which worksharing display mode a view is in.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WorksharingDisplayMode
```
```vb
Public Enumeration WorksharingDisplayMode
```
```cpp
public enum class WorksharingDisplayMode
```
```fsharp
type WorksharingDisplayMode
```

| Member name | Value | Description |
| --- | --- | --- |
| CheckoutStatus | 1 | The view is displaying the checkout status of elements. |
| ModelUpdates | 3 | The view is displaying model updates. |
| Off | 0 | No active worksharing display mode. |
| Owners | 2 | The view is displaying the specific owners of elements. |
| Worksets | 4 | The view is displaying which workset each element is assigned to. |

#### Reference

Autodesk.Revit.DB Namespace